tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18876_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F18876_H_
#define _PIC16F18876_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define RA6                           35
#define RA7                           36
#define PORTB                         37
#define RB0                           38
#define RB1                           39
#define RB2                           40
#define RB3                           41
#define RB4                           42
#define RB5                           43
#define RB6                           44
#define RB7                           45
#define PORTC                         46
#define RC0                           47
#define RC1                           48
#define RC2                           49
#define RC3                           50
#define RC4                           51
#define RC5                           52
#define RC6                           53
#define RC7                           54
#define PORTD                         55
#define RD0                           56
#define RD1                           57
#define RD2                           58
#define RD3                           59
#define RD4                           60
#define RD5                           61
#define RD6                           62
#define RD7                           63
#define PORTE                         64
#define RE0                           65
#define RE1                           66
#define RE2                           67
#define RE3                           68
#define TRISA                         69
#define TRISA0                        70
#define TRISA1                        71
#define TRISA2                        72
#define TRISA3                        73
#define TRISA4                        74
#define TRISA5                        75
#define TRISA6                        76
#define TRISA7                        77
#define TRISB                         78
#define TRISB0                        79
#define TRISB1                        80
#define TRISB2                        81
#define TRISB3                        82
#define TRISB4                        83
#define TRISB5                        84
#define TRISB6                        85
#define TRISB7                        86
#define TRISC                         87
#define TRISC0                        88
#define TRISC1                        89
#define TRISC2                        90
#define TRISC3                        91
#define TRISC4                        92
#define TRISC5                        93
#define TRISC6                        94
#define TRISC7                        95
#define TRISD                         96
#define TRISD0                        97
#define TRISD1                        98
#define TRISD2                        99
#define TRISD3                        100
#define TRISD4                        101
#define TRISD5                        102
#define TRISD6                        103
#define TRISD7                        104
#define TRISE                         105
#define TRISE0                        106
#define TRISE1                        107
#define TRISE2                        108
#define LATA                          109
#define LATA0                         110
#define LATA1                         111
#define LATA2                         112
#define LATA3                         113
#define LATA4                         114
#define LATA5                         115
#define LATA6                         116
#define LATA7                         117
#define LATB                          118
#define LATB0                         119
#define LATB1                         120
#define LATB2                         121
#define LATB3                         122
#define LATB4                         123
#define LATB5                         124
#define LATB6                         125
#define LATB7                         126
#define LATC                          127
#define LATC0                         128
#define LATC1                         129
#define LATC2                         130
#define LATC3                         131
#define LATC4                         132
#define LATC5                         133
#define LATC6                         134
#define LATC7                         135
#define LATD                          136
#define LATD0                         137
#define LATD1                         138
#define LATD2                         139
#define LATD3                         140
#define LATD4                         141
#define LATD5                         142
#define LATD6                         143
#define LATD7                         144
#define LATE                          145
#define LATE0                         146
#define LATE1                         147
#define LATE2                         148
#define TMR0L0                        149
#define TMR0L                         150
#define TMR0L1                        151
#define TMR0L2                        152
#define TMR0L3                        153
#define TMR0L4                        154
#define TMR0L5                        155
#define TMR0L6                        156
#define TMR0L7                        157
#define TMR0H0                        158
#define T0PR                          159
#define TMR0H                         160
#define T0PR0                         161
#define TMR0H1                        162
#define T0PR1                         163
#define TMR0H2                        164
#define T0PR2                         165
#define TMR0H3                        166
#define T0PR3                         167
#define TMR0H4                        168
#define T0PR4                         169
#define TMR0H5                        170
#define T0PR5                         171
#define TMR0H6                        172
#define T0PR6                         173
#define TMR0H7                        174
#define T0PR7                         175
#define T0CON0                        176
#define T0OUTPS                       177
#define T0OUTPS0                      178
#define T0OUTPS1                      179
#define T0OUTPS2                      180
#define T0OUTPS3                      181
#define T016BIT                       182
#define T0OUT                         183
#define T0EN                          184
#define T0CON1                        185
#define T0PS                          186
#define T0CKPS                        187
#define T0CKPS0                       188
#define T0PS0                         189
#define T0CKPS1                       190
#define T0PS1                         191
#define T0CKPS2                       192
#define T0PS2                         193
#define T0CKPS3                       194
#define T0PS3                         195
#define T0ASYNC                       196
#define T0CS                          197
#define T0CS0                         198
#define T0CS1                         199
#define T0CS2                         200
#define ADRESL                        201
#define ADPREVL                       202
#define ADPREV0                       203
#define ADPREV1                       204
#define ADPREV2                       205
#define ADPREV3                       206
#define ADPREV4                       207
#define ADPREV5                       208
#define ADPREV6                       209
#define ADPREV7                       210
#define ADPREVH                       211
#define ADPREV8                       212
#define ADPREV9                       213
#define ADPREV10                      214
#define ADPREV11                      215
#define ADPREV12                      216
#define ADPREV13                      217
#define ADPREV14                      218
#define ADPREV15                      219
#define ADACC0                        220
#define ADACCL                        221
#define ADACC1                        222
#define ADACC2                        223
#define ADACC3                        224
#define ADACC4                        225
#define ADACC5                        226
#define ADACC6                        227
#define ADACC7                        228
#define ADACC8                        229
#define ADACCH                        230
#define ADACC9                        231
#define ADACC10                       232
#define ADACC11                       233
#define ADACC12                       234
#define ADACC13                       235
#define ADACC14                       236
#define ADACC15                       237
#define ADCON0                        238
#define nDONE                         239
#define DONE                          240
#define GO                            241
#define GO_nDONE                      242
#define ADGO                          243
#define ADFM                          244
#define ADFM0                         245
#define ADFM1                         246
#define ADCS                          247
#define ADCONT                        248
#define ADON                          249
#define ADCON1                        250
#define ADDSEN                        251
#define ADGPOL                        252
#define ADIPEN                        253
#define ADPPOL                        254
#define ADCON2                        255
#define ADMD                          256
#define ADMD0                         257
#define ADMD1                         258
#define ADMD2                         259
#define ADACLR                        260
#define ADCRS                         261
#define ADCRS0                        262
#define ADCRS1                        263
#define ADCRS2                        264
#define ADPSIS                        265
#define ADCON3                        266
#define ADTMD                         267
#define ADTMD0                        268
#define ADTMD1                        269
#define ADTMD2                        270
#define ADSOI                         271
#define ADCALC                        272
#define ADCALC0                       273
#define ADCALC1                       274
#define ADCALC2                       275
#define ADSTAT                        276
#define ADSTAT0                       277
#define ADSTAT1                       278
#define ADSTAT2                       279
#define ADMACT                        280
#define ADMATH                        281
#define ADLTHR                        282
#define ADUTHR                        283
#define ADAOV                         284
#define ADCLK                         285
#define ADCCS0                        286
#define ADCCS                         287
#define ADCCS1                        288
#define ADCCS2                        289
#define ADCCS3                        290
#define ADCCS4                        291
#define ADCCS5                        292
#define ADACT0                        293
#define ADACT                         294
#define ADACT1                        295
#define ADACT2                        296
#define ADACT3                        297
#define ADACT4                        298
#define ADREF                         299
#define ADPREF                        300
#define ADPREF0                       301
#define ADPREF1                       302
#define ADNREF                        303
#define ADCAP                         304
#define ADCAP0                        305
#define ADCAP1                        306
#define ADCAP2                        307
#define ADCAP3                        308
#define ADCAP4                        309
#define ADPRE0                        310
#define ADPRE                         311
#define ADPRE1                        312
#define ADPRE2                        313
#define ADPRE3                        314
#define ADPRE4                        315
#define ADPRE5                        316
#define ADPRE6                        317
#define ADPRE7                        318
#define ADACQ                         319
#define ADACQ0                        320
#define ADACQ1                        321
#define ADACQ2                        322
#define ADACQ3                        323
#define ADACQ4                        324
#define ADACQ5                        325
#define ADACQ6                        326
#define ADACQ7                        327
#define ADPCH                         328
#define ADPCH0                        329
#define ADPCH1                        330
#define ADPCH2                        331
#define ADPCH3                        332
#define ADPCH4                        333
#define ADPCH5                        334
#define ADCNT0                        335
#define ADCNT                         336
#define ADCNT1                        337
#define ADCNT2                        338
#define ADCNT3                        339
#define ADCNT4                        340
#define ADCNT5                        341
#define ADCNT6                        342
#define ADCNT7                        343
#define ADRPT0                        344
#define ADRPT                         345
#define ADRPT1                        346
#define ADRPT2                        347
#define ADRPT3                        348
#define ADRPT4                        349
#define ADRPT5                        350
#define ADRPT6                        351
#define ADRPT7                        352
#define ADLTH0                        353
#define ADLTHL                        354
#define ADLTH1                        355
#define ADLTH2                        356
#define ADLTH3                        357
#define ADLTH4                        358
#define ADLTH5                        359
#define ADLTH6                        360
#define ADLTH7                        361
#define ADLTH8                        362
#define ADLTHH                        363
#define ADLTH9                        364
#define ADLTH10                       365
#define ADLTH11                       366
#define ADLTH12                       367
#define ADLTH13                       368
#define ADLTH14                       369
#define ADLTH15                       370
#define ADUTH0                        371
#define ADUTHL                        372
#define ADUTH1                        373
#define ADUTH2                        374
#define ADUTH3                        375
#define ADUTH4                        376
#define ADUTH5                        377
#define ADUTH6                        378
#define ADUTH7                        379
#define ADUTH8                        380
#define ADUTHH                        381
#define ADUTH9                        382
#define ADUTH10                       383
#define ADUTH11                       384
#define ADUTH12                       385
#define ADUTH13                       386
#define ADUTH14                       387
#define ADUTH15                       388
#define ADSTPT0                       389
#define ADSTPTL                       390
#define ADSTPT1                       391
#define ADSTPT2                       392
#define ADSTPT3                       393
#define ADSTPT4                       394
#define ADSTPT5                       395
#define ADSTPT6                       396
#define ADSTPT7                       397
#define ADSTPT8                       398
#define ADSTPTH                       399
#define ADSTPT9                       400
#define ADSTPT10                      401
#define ADSTPT11                      402
#define ADSTPT12                      403
#define ADSTPT13                      404
#define ADSTPT14                      405
#define ADSTPT15                      406
#define ADFLTR0                       407
#define ADFLTRL                       408
#define ADFLTR1                       409
#define ADFLTR2                       410
#define ADFLTR3                       411
#define ADFLTR4                       412
#define ADFLTR5                       413
#define ADFLTR6                       414
#define ADFLTR7                       415
#define ADFLTR8                       416
#define ADFLTRH                       417
#define ADFLTR9                       418
#define ADFLTR10                      419
#define ADFLTR11                      420
#define ADFLTR12                      421
#define ADFLTR13                      422
#define ADFLTR14                      423
#define ADFLTR15                      424
#define ADERR0                        425
#define ADERRL                        426
#define ADERR1                        427
#define ADERR2                        428
#define ADERR3                        429
#define ADERR4                        430
#define ADERR5                        431
#define ADERR6                        432
#define ADERR7                        433
#define ADERR8                        434
#define ADERRH                        435
#define ADERR9                        436
#define ADERR10                       437
#define ADERR11                       438
#define ADERR12                       439
#define ADERR13                       440
#define ADERR14                       441
#define ADERR15                       442
#define RC1REG                        443
#define TX1REG                        444
#define SP1BRGL                       445
#define SP1BRGH                       446
#define RC1STA                        447
#define RX9D                          448
#define OERR                          449
#define FERR                          450
#define ADDEN                         451
#define CREN                          452
#define SREN                          453
#define RX9                           454
#define SPEN                          455
#define TX1STA                        456
#define TX9D                          457
#define TRMT                          458
#define BRGH                          459
#define SENDB                         460
#define TX1STA_SYNC                   461
#define TXEN                          462
#define TX9                           463
#define CSRC                          464
#define BAUD1CON                      465
#define ABDEN                         466
#define WUE                           467
#define BRG16                         468
#define SCKP                          469
#define RCIDL                         470
#define ABDOVF                        471
#define SSP1BUF                       472
#define SSP1BUF_SSPBUF                473
#define SSP1ADD                       474
#define SSP1ADD_SSPADD                475
#define SSP1MSK                       476
#define SSP1MSK_MSK0                  477
#define SSP1MSK_SSPMSK                478
#define SSP1MSK_MSK1                  479
#define SSP1MSK_MSK2                  480
#define SSP1MSK_MSK3                  481
#define SSP1MSK_MSK4                  482
#define SSP1MSK_MSK5                  483
#define SSP1MSK_MSK6                  484
#define SSP1MSK_MSK7                  485
#define SSP1STAT                      486
#define SSP1STAT_BF                   487
#define SSP1STAT_UA                   488
#define SSP1STAT_nWRITE               489
#define SSP1STAT_nW                   490
#define SSP1STAT_READ_WRITE           491
#define SSP1STAT_I2C_READ             492
#define SSP1STAT_R_W                  493
#define SSP1STAT_R_nW                 494
#define SSP1STAT_S                    495
#define SSP1STAT_I2C_START            496
#define SSP1STAT_P                    497
#define SSP1STAT_I2C_STOP             498
#define SSP1STAT_D_A                  499
#define SSP1STAT_D_nA                 500
#define SSP1STAT_DATA_ADDRESS         501
#define SSP1STAT_nA                   502
#define SSP1STAT_nADDRESS             503
#define SSP1STAT_I2C_DAT              504
#define SSP1STAT_CKE                  505
#define SSP1STAT_SMP                  506
#define SSP1CON1                      507
#define SSP1CON1_SSPM                 508
#define SSP1CON1_SSPM0                509
#define SSP1CON1_SSPM1                510
#define SSP1CON1_SSPM2                511
#define SSP1CON1_SSPM3                512
#define SSP1CON1_CKP                  513
#define SSP1CON1_SSPEN                514
#define SSP1CON1_SSPOV                515
#define SSP1CON1_WCOL                 516
#define SSP1CON2                      517
#define SSP1CON2_SEN                  518
#define SSP1CON2_RSEN                 519
#define SSP1CON2_ADMSK1               520
#define SSP1CON2_ADMSK                521
