tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18876_tdd.h
#define SSP1CON2_ADMSK2               522
#define SSP1CON2_PEN                  523
#define SSP1CON2_RCEN                 524
#define SSP1CON2_ADMSK3               525
#define SSP1CON2_ACKEN                526
#define SSP1CON2_ADMSK4               527
#define SSP1CON2_ACKDT                528
#define SSP1CON2_ADMSK5               529
#define SSP1CON2_ACKSTAT              530
#define SSP1CON2_GCEN                 531
#define SSP1CON3                      532
#define SSP1CON3_DHEN                 533
#define SSP1CON3_AHEN                 534
#define SSP1CON3_SBCDE                535
#define SSP1CON3_SDAHT                536
#define SSP1CON3_BOEN                 537
#define SSP1CON3_SCIE                 538
#define SSP1CON3_PCIE                 539
#define SSP1CON3_ACKTIM               540
#define SSP2BUF                       541
#define SSP2BUF_SSPBUF                542
#define SSP2ADD                       543
#define SSP2ADD_SSPADD                544
#define SSP2MSK                       545
#define SSP2MSK_SSPMSK                546
#define SSP2MSK_MSK0                  547
#define SSP2MSK_MSK1                  548
#define SSP2MSK_MSK2                  549
#define SSP2MSK_MSK3                  550
#define SSP2MSK_MSK4                  551
#define SSP2MSK_MSK5                  552
#define SSP2MSK_MSK6                  553
#define SSP2MSK_MSK7                  554
#define SSP2STAT                      555
#define SSP2STAT_BF                   556
#define SSP2STAT_UA                   557
#define SSP2STAT_R_W                  558
#define SSP2STAT_nWRITE               559
#define SSP2STAT_I2C_READ             560
#define SSP2STAT_READ_WRITE           561
#define SSP2STAT_R_nW                 562
#define SSP2STAT_nW                   563
#define SSP2STAT_I2C_START            564
#define SSP2STAT_S                    565
#define SSP2STAT_I2C_STOP             566
#define SSP2STAT_P                    567
#define SSP2STAT_I2C_DAT              568
#define SSP2STAT_D_nA                 569
#define SSP2STAT_DATA_ADDRESS         570
#define SSP2STAT_nADDRESS             571
#define SSP2STAT_nA                   572
#define SSP2STAT_D_A                  573
#define SSP2STAT_CKE                  574
#define SSP2STAT_SMP                  575
#define SSP2CON1                      576
#define SSP2CON1_SSPM                 577
#define SSP2CON1_SSPM0                578
#define SSP2CON1_SSPM1                579
#define SSP2CON1_SSPM2                580
#define SSP2CON1_SSPM3                581
#define SSP2CON1_CKP                  582
#define SSP2CON1_SSPEN                583
#define SSP2CON1_SSPOV                584
#define SSP2CON1_WCOL                 585
#define SSP2CON2                      586
#define SSP2CON2_SEN                  587
#define SSP2CON2_ADMSK                588
#define SSP2CON2_RSEN                 589
#define SSP2CON2_ADMSK1               590
#define SSP2CON2_PEN                  591
#define SSP2CON2_ADMSK2               592
#define SSP2CON2_RCEN                 593
#define SSP2CON2_ADMSK3               594
#define SSP2CON2_ADMSK4               595
#define SSP2CON2_ACKEN                596
#define SSP2CON2_ADMSK5               597
#define SSP2CON2_ACKDT                598
#define SSP2CON2_ACKSTAT              599
#define SSP2CON2_GCEN                 600
#define SSP2CON3                      601
#define SSP2CON3_DHEN                 602
#define SSP2CON3_AHEN                 603
#define SSP2CON3_SBCDE                604
#define SSP2CON3_SDAHT                605
#define SSP2CON3_BOEN                 606
#define SSP2CON3_SCIE                 607
#define SSP2CON3_PCIE                 608
#define SSP2CON3_ACKTIM               609
#define TMR1L                         610
#define TMR1L0                        611
#define TMR1L1                        612
#define TMR1L2                        613
#define TMR1L3                        614
#define TMR1L4                        615
#define TMR1L5                        616
#define TMR1L6                        617
#define TMR1L7                        618
#define TMR1H0                        619
#define TMR1H                         620
#define TMR1H1                        621
#define TMR1H2                        622
#define TMR1H3                        623
#define TMR1H4                        624
#define TMR1H5                        625
#define TMR1H6                        626
#define TMR1H7                        627
#define T1CON                         628
#define TMR1ON                        629
#define T1CON_ON                      630
#define T1CON_RD16                    631
#define T1RD16                        632
#define nT1SYNC                       633
#define T1CON_nSYNC                   634
#define T1CON_CKPS0                   635
#define T1CKPS0                       636
#define T1CON_CKPS                    637
#define T1CKPS1                       638
#define T1CON_CKPS1                   639
#define T1GCON                        640
#define T1GCON_GVAL                   641
#define T1GVAL                        642
#define T1GGO_nDONE                   643
#define T1GCON_GGO_nDONE              644
#define T1GGO                         645
#define T1GSPM                        646
#define T1GCON_GSPM                   647
#define T1GTM                         648
#define T1GCON_GTM                    649
#define T1GPOL                        650
#define T1GCON_GPOL                   651
#define T1GE                          652
#define T1GCON_GE                     653
#define T1GATE                        654
#define T1GSS0                        655
#define T1GATE_GSS                    656
#define T1GATE_GSS0                   657
#define T1GATE_GSS1                   658
#define T1GSS1                        659
#define T1GSS2                        660
#define T1GATE_GSS2                   661
#define T1GSS3                        662
#define T1GATE_GSS3                   663
#define T1GATE_GSS4                   664
#define T1GSS4                        665
#define T1CLK                         666
#define T1CS0                         667
#define T1CLK_CS                      668
#define T1CLK_CS0                     669
#define T1CLK_CS1                     670
#define T1CS1                         671
#define T1CS2                         672
#define T1CLK_CS2                     673
#define T1CS3                         674
#define T1CLK_CS3                     675
#define TMR3L0                        676
#define TMR3L                         677
#define TMR3L1                        678
#define TMR3L2                        679
#define TMR3L3                        680
#define TMR3L4                        681
#define TMR3L5                        682
#define TMR3L6                        683
#define TMR3L7                        684
#define TMR3H                         685
#define TMR3H0                        686
#define TMR3H1                        687
#define TMR3H2                        688
#define TMR3H3                        689
#define TMR3H4                        690
#define TMR3H5                        691
#define TMR3H6                        692
#define TMR3H7                        693
#define T3CON                         694
#define TMR3ON                        695
#define T3CON_ON                      696
#define T3CON_RD16                    697
#define T3RD16                        698
#define nT3SYNC                       699
#define T3CON_nSYNC                   700
#define T3CKPS0                       701
#define T3CON_CKPS                    702
#define T3CON_CKPS0                   703
#define T3CKPS1                       704
#define T3CON_CKPS1                   705
#define T3GCON                        706
#define T3GVAL                        707
#define T3GCON_GVAL                   708
#define T3GGO                         709
#define T3GCON_GGO_nDONE              710
#define T3GGO_nDONE                   711
#define T3GCON_GSPM                   712
#define T3GSPM                        713
#define T3GTM                         714
#define T3GCON_GTM                    715
#define T3GPOL                        716
#define T3GCON_GPOL                   717
#define T3GCON_GE                     718
#define T3GE                          719
#define T3GATE                        720
#define T3GSS0                        721
#define T3GATE_GSS0                   722
#define T3GATE_GSS                    723
#define T3GATE_GSS1                   724
#define T3GSS1                        725
#define T3GSS2                        726
#define T3GATE_GSS2                   727
#define T3GATE_GSS3                   728
#define T3GSS3                        729
#define T3GATE_GSS4                   730
#define T3GSS4                        731
#define T3CLK                         732
#define T3CLK_CS                      733
#define T3CLK_CS0                     734
#define T3CS0                         735
#define T3CLK_CS1                     736
#define T3CS1                         737
#define T3CLK_CS2                     738
#define T3CS2                         739
#define T3CS3                         740
#define T3CLK_CS3                     741
#define TMR5L                         742
#define TMR5L0                        743
#define TMR5L1                        744
#define TMR5L2                        745
#define TMR5L3                        746
#define TMR5L4                        747
#define TMR5L5                        748
#define TMR5L6                        749
#define TMR5L7                        750
#define TMR5H0                        751
#define TMR5H                         752
#define TMR5H1                        753
#define TMR5H2                        754
#define TMR5H3                        755
#define TMR5H4                        756
#define TMR5H5                        757
#define TMR5H6                        758
#define TMR5H7                        759
#define T5CON                         760
#define T5CON_ON                      761
#define TMR5ON                        762
#define T5CON_RD16                    763
#define T5RD16                        764
#define T5CON_nSYNC                   765
#define nT5SYNC                       766
#define T5CON_CKPS0                   767
#define T5CON_CKPS                    768
#define T5CKPS0                       769
#define T5CON_CKPS1                   770
#define T5CKPS1                       771
#define T5GCON                        772
#define T5GCON_GVAL                   773
#define T5GVAL                        774
#define T5GCON_GGO_nDONE              775
#define T5GGO_nDONE                   776
#define T5GGO                         777
#define T5GCON_GSPM                   778
#define T5GSPM                        779
#define T5GTM                         780
#define T5GCON_GTM                    781
#define T5GPOL                        782
#define T5GCON_GPOL                   783
#define T5GCON_GE                     784
#define T5GE                          785
#define T5GATE                        786
#define T5GATE_GSS0                   787
#define T5GSS0                        788
#define T5GATE_GSS                    789
#define T5GSS1                        790
#define T5GATE_GSS1                   791
#define T5GATE_GSS2                   792
#define T5GSS2                        793
#define T5GATE_GSS3                   794
#define T5GSS3                        795
#define T5GSS4                        796
#define T5GATE_GSS4                   797
#define T5CLK                         798
#define T5CS0                         799
#define T5CLK_CS                      800
#define T5CLK_CS0                     801
#define T5CS1                         802
#define T5CLK_CS1                     803
#define T5CS2                         804
#define T5CLK_CS2                     805
#define T5CS3                         806
#define T5CLK_CS3                     807
#define CCPTMRS0                      808
#define C1TSEL0                       809
#define C1TSEL                        810
#define C1TSEL1                       811
#define C2TSEL0                       812
#define C2TSEL                        813
#define C2TSEL1                       814
#define C3TSEL0                       815
#define C3TSEL                        816
#define C3TSEL1                       817
#define C4TSEL                        818
#define C4TSEL0                       819
#define C4TSEL1                       820
#define CCPTMRS1                      821
#define C5TSEL                        822
#define C5TSEL0                       823
#define C5TSEL1                       824
#define P6TSEL0                       825
#define P6TSEL                        826
#define P6TSEL1                       827
#define P7TSEL0                       828
#define P7TSEL                        829
#define P7TSEL1                       830
#define T2TMR                         831
#define TMR2                          832
#define T2PR                          833
#define PR2                           834
#define T2CON                         835
#define T2OUTPS0                      836
#define T2CON_OUTPS0                  837
#define T2OUTPS                       838
#define T2CON_OUTPS                   839
#define T2OUTPS1                      840
#define T2CON_OUTPS1                  841
#define T2OUTPS2                      842
#define T2CON_OUTPS2                  843
#define T2OUTPS3                      844
#define T2CON_OUTPS3                  845
#define T2CKPS0                       846
#define T2CON_CKPS0                   847
#define T2CON_CKPS                    848
#define T2CKPS                        849
#define T2CKPS1                       850
#define T2CON_CKPS1                   851
#define T2CKPS2                       852
#define T2CON_CKPS2                   853
#define T2CON_ON                      854
#define TMR2ON                        855
#define T2ON                          856
#define T2HLT                         857
#define T2HLT_MODE                    858
#define T2MODE                        859
#define T2MODE0                       860
#define T2HLT_MODE0                   861
#define T2MODE1                       862
#define T2HLT_MODE1                   863
#define T2MODE2                       864
#define T2HLT_MODE2                   865
#define T2MODE3                       866
#define T2HLT_MODE3                   867
#define T2MODE4                       868
#define T2HLT_MODE4                   869
#define T2HLT_CKSYNC                  870
#define T2CKSYNC                      871
#define T2HLT_CKPOL                   872
#define T2CKPOL                       873
#define T2PSYNC                       874
#define T2HLT_PSYNC                   875
#define T2CLKCON                      876
#define T2CS                          877
#define T2CS0                         878
#define T2CS1                         879
#define T2CS2                         880
#define T2CS3                         881
#define T2RST                         882
#define T2RSEL                        883
#define T2RST_RSEL                    884
#define T2RSEL0                       885
#define T2RST_RSEL0                   886
#define T2RSEL1                       887
#define T2RST_RSEL1                   888
#define T2RST_RSEL2                   889
#define T2RSEL2                       890
#define T2RSEL3                       891
#define T2RST_RSEL3                   892
#define T2RSEL4                       893
#define T2RST_RSEL4                   894
#define T4TMR                         895
#define TMR4                          896
#define T4PR                          897
#define PR4                           898
#define T4CON                         899
#define T4CON_OUTPS                   900
#define T4OUTPS0                      901
#define T4OUTPS                       902
#define T4CON_OUTPS0                  903
#define T4OUTPS1                      904
#define T4CON_OUTPS1                  905
#define T4CON_OUTPS2                  906
#define T4OUTPS2                      907
#define T4OUTPS3                      908
#define T4CON_OUTPS3                  909
#define T4CKPS0                       910
#define T4CON_CKPS                    911
#define T4CON_CKPS0                   912
#define T4CKPS                        913
#define T4CKPS1                       914
#define T4CON_CKPS1                   915
#define T4CKPS2                       916
#define T4CON_CKPS2                   917
#define T4ON                          918
#define T4CON_ON                      919
#define TMR4ON                        920
#define T4HLT                         921
#define T4MODE                        922
#define T4HLT_MODE                    923
#define T4HLT_MODE0                   924
#define T4MODE0                       925
#define T4HLT_MODE1                   926
#define T4MODE1                       927
#define T4HLT_MODE2                   928
#define T4MODE2                       929
#define T4HLT_MODE3                   930
#define T4MODE3                       931
#define T4HLT_MODE4                   932
#define T4MODE4                       933
#define T4CKSYNC                      934
#define T4HLT_CKSYNC                  935
#define T4HLT_CKPOL                   936
#define T4CKPOL                       937
#define T4PSYNC                       938
#define T4HLT_PSYNC                   939
#define T4CLKCON                      940
#define T4CS0                         941
#define T4CS                          942
#define T4CS1                         943
#define T4CS2                         944
#define T4CS3                         945
#define T4RST                         946
#define T4RST_RSEL                    947
#define T4RSEL0                       948
#define T4RSEL                        949
#define T4RST_RSEL0                   950
#define T4RSEL1                       951
#define T4RST_RSEL1                   952
#define T4RSEL2                       953
#define T4RST_RSEL2                   954
#define T4RSEL3                       955
#define T4RST_RSEL3                   956
#define T4RSEL4                       957
#define T4RST_RSEL4                   958
#define T6TMR                         959
#define TMR6                          960
#define T6PR                          961
#define PR6                           962
#define T6CON                         963
#define T6CON_OUTPS0                  964
#define T6OUTPS                       965
#define T6CON_OUTPS                   966
#define T6OUTPS0                      967
#define T6CON_OUTPS1                  968
#define T6OUTPS1                      969
#define T6CON_OUTPS2                  970
#define T6OUTPS2                      971
#define T6CON_OUTPS3                  972
#define T6OUTPS3                      973
#define T6CON_CKPS0                   974
#define T6CKPS                        975
#define T6CKPS0                       976
#define T6CON_CKPS                    977
#define T6CON_CKPS1                   978
#define T6CKPS1                       979
#define T6CON_CKPS2                   980
#define T6CKPS2                       981
#define TMR6ON                        982
#define T6ON                          983
#define T6CON_ON                      984
#define T6HLT                         985
#define T6MODE0                       986
#define T6HLT_MODE0                   987
#define T6HLT_MODE                    988
#define T6MODE                        989
#define T6HLT_MODE1                   990
#define T6MODE1                       991
#define T6HLT_MODE2                   992
#define T6MODE2                       993
#define T6HLT_MODE3                   994
#define T6MODE3                       995
#define T6MODE4                       996
#define T6HLT_MODE4                   997
#define T6CKSYNC                      998
#define T6HLT_CKSYNC                  999
#define T6CKPOL                       1000
#define T6HLT_CKPOL                   1001
#define T6PSYNC                       1002
#define T6HLT_PSYNC                   1003
#define T6CLKCON                      1004
#define T6CS                          1005
#define T6CS0                         1006
#define T6CS1                         1007
#define T6CS2                         1008
#define T6CS3                         1009
#define T6RST                         1010
#define T6RST_RSEL                    1011
#define T6RSEL                        1012
#define T6RSEL0                       1013
#define T6RST_RSEL0                   1014
#define T6RST_RSEL1                   1015
#define T6RSEL1                       1016
#define T6RSEL2                       1017
#define T6RST_RSEL2                   1018
#define T6RST_RSEL3                   1019
#define T6RSEL3                       1020
#define T6RST_RSEL4                   1021
#define T6RSEL4                       1022
#define CCPR1L                        1023
#define CCPR1L_RL                     1024
#define CCPR1H                        1025
#define CCPR1H_RH                     1026
#define CCP1CON                       1027
#define CCP1MODE0                     1028
#define CCP1CON_MODE0                 1029
#define CCP1CON_MODE                  1030
#define CCP1MODE                      1031
#define CCP1MODE1                     1032
#define CCP1CON_MODE1                 1033
#define CCP1MODE2                     1034
#define CCP1CON_MODE2                 1035
#define CCP1MODE3                     1036
#define CCP1CON_MODE3                 1037
#define CCP1FMT                       1038
#define CCP1CON_FMT                   1039
#define CCP1CON_OUT                   1040
#define CCP1OUT                       1041
#define CCP1CON_OE                    1042
#define CCP1OE                        1043
#define CCP1EN                        1044
#define CCP1CON_EN                    1045
#define CCP1CAP                       1046
#define CCP1CTS0                      1047
#define CCP1CAP_CTS                   1048
#define CCP1CAP_CTS0                  1049
#define CCP1CTS                       1050
#define CCP1CTS1                      1051
#define CCP1CAP_CTS1                  1052
#define CCP1CTS2                      1053
#define CCP1CAP_CTS2                  1054
#define CCPR2L                        1055
#define CCPR2L_RL                     1056
#define CCPR2H                        1057
#define CCPR2H_RH                     1058
#define CCP2CON                       1059
#define CCP2MODE                      1060
#define CCP2MODE0                     1061
#define CCP2CON_MODE0                 1062
#define CCP2CON_MODE                  1063
#define CCP2MODE1                     1064
#define CCP2CON_MODE1                 1065
#define CCP2MODE2                     1066
#define CCP2CON_MODE2                 1067
#define CCP2MODE3                     1068
#define CCP2CON_MODE3                 1069
#define CCP2FMT                       1070
#define CCP2CON_FMT                   1071
#define CCP2OUT                       1072
#define CCP2CON_OUT                   1073
#define CCP2OE                        1074
#define CCP2CON_OE                    1075
#define CCP2EN                        1076
#define CCP2CON_EN                    1077
#define CCP2CAP                       1078
#define CCP2CAP_CTS                   1079
#define CCP2CAP_CTS0                  1080
#define CCP2CTS                       1081
#define CCP2CTS0                      1082
#define CCP2CAP_CTS1                  1083
#define CCP2CTS1                      1084
#define CCP2CAP_CTS2                  1085
#define CCP2CTS2                      1086
#define CCPR3L                        1087
#define CCPR3L_RL                     1088
#define CCPR3H                        1089
#define CCPR3H_RH                     1090
