tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18876_tdd.h
#define C1NCH1                        2765
#define CM1NSEL_NCH2                  2766
#define C1NCH2                        2767
#define CM1PSEL                       2768
#define CM1PSEL_PCH                   2769
#define C1PCH                         2770
#define C1PCH0                        2771
#define CM1PSEL_PCH0                  2772
#define C1PCH1                        2773
#define CM1PSEL_PCH1                  2774
#define C1PCH2                        2775
#define CM1PSEL_PCH2                  2776
#define CM2CON0                       2777
#define CM2CON0_SYNC                  2778
#define C2SYNC                        2779
#define C2HYS                         2780
#define CM2CON0_HYS                   2781
#define C2SP                          2782
#define C2POL                         2783
#define CM2CON0_POL                   2784
#define CM2CON0_C2OUT                 2785
#define CM2CON0_OUT                   2786
#define CM2CON0_ON                    2787
#define C2ON                          2788
#define CM2CON1                       2789
#define C2INTN                        2790
#define CM2CON1_INTN                  2791
#define CM2CON1_INTP                  2792
#define C2INTP                        2793
#define CM2NSEL                       2794
#define C2NCH0                        2795
#define CM2NSEL_NCH0                  2796
#define C2NCH                         2797
#define CM2NSEL_NCH                   2798
#define C2NCH1                        2799
#define CM2NSEL_NCH1                  2800
#define C2NCH2                        2801
#define CM2NSEL_NCH2                  2802
#define CM2PSEL                       2803
#define CM2PSEL_PCH                   2804
#define C2PCH                         2805
#define C2PCH0                        2806
#define CM2PSEL_PCH0                  2807
#define C2PCH1                        2808
#define CM2PSEL_PCH1                  2809
#define CM2PSEL_PCH2                  2810
#define C2PCH2                        2811
#define CLCDATA                       2812
#define MLC1OUT                       2813
#define MLC2OUT                       2814
#define MLC3OUT                       2815
#define MLC4OUT                       2816
#define CLC1CON                       2817
#define CLC1CON_MODE                  2818
#define LC1MODE0                      2819
#define LC1MODE                       2820
#define CLC1CON_MODE0                 2821
#define LC1MODE1                      2822
#define CLC1CON_MODE1                 2823
#define LC1MODE2                      2824
#define CLC1CON_MODE2                 2825
#define LC1INTN                       2826
#define CLC1CON_INTN                  2827
#define LC1INTP                       2828
#define CLC1CON_INTP                  2829
#define LC1OUT                        2830
#define CLC1CON_OUT                   2831
#define LC1EN                         2832
#define CLC1CON_EN                    2833
#define CLC1POL                       2834
#define LC1G1POL                      2835
#define CLC1POL_G1POL                 2836
#define CLC1POL_G2POL                 2837
#define LC1G2POL                      2838
#define LC1G3POL                      2839
#define CLC1POL_G3POL                 2840
#define LC1G4POL                      2841
#define CLC1POL_G4POL                 2842
#define CLC1POL_POL                   2843
#define LC1POL                        2844
#define CLC1SEL0                      2845
#define LC1D1S                        2846
#define CLC1SEL0_D1S0                 2847
#define LC1D1S0                       2848
#define CLC1SEL0_D1S                  2849
#define CLC1SEL0_D1S1                 2850
#define LC1D1S1                       2851
#define CLC1SEL0_D1S2                 2852
#define LC1D1S2                       2853
#define CLC1SEL0_D1S3                 2854
#define LC1D1S3                       2855
#define LC1D1S4                       2856
#define CLC1SEL0_D1S4                 2857
#define CLC1SEL0_D1S5                 2858
#define LC1D1S5                       2859
#define LC1D1S6                       2860
#define CLC1SEL0_D1S6                 2861
#define LC1D1S7                       2862
#define CLC1SEL0_D1S7                 2863
#define CLC1SEL1                      2864
#define CLC1SEL1_D2S                  2865
#define CLC1SEL1_D2S0                 2866
#define LC1D2S0                       2867
#define LC1D2S                        2868
#define CLC1SEL1_D2S1                 2869
#define LC1D2S1                       2870
#define CLC1SEL1_D2S2                 2871
#define LC1D2S2                       2872
#define CLC1SEL1_D2S3                 2873
#define LC1D2S3                       2874
#define LC1D2S4                       2875
#define CLC1SEL1_D2S4                 2876
#define D2S5                          2877
#define LC1D2S5                       2878
#define LC1D2S6                       2879
#define CLC1SEL1_D2S6                 2880
#define CLC1SEL1_D2S7                 2881
#define LC1D2S7                       2882
#define CLC1SEL2                      2883
#define CLC1SEL2_D3S                  2884
#define LC1D3S0                       2885
#define LC1D3S                        2886
#define CLC1SEL2_D3S0                 2887
#define LC1D3S1                       2888
#define CLC1SEL2_D3S1                 2889
#define LC1D3S2                       2890
#define CLC1SEL2_D3S2                 2891
#define LC1D3S3                       2892
#define CLC1SEL2_D3S3                 2893
#define LC1D3S4                       2894
#define CLC1SEL2_D3S4                 2895
#define LC1D3S5                       2896
#define CLC1SEL2_D3S5                 2897
#define LC1D3S6                       2898
#define CLC1SEL2_D3S6                 2899
#define LC1D3S7                       2900
#define CLC1SEL2_D3S7                 2901
#define CLC1SEL3                      2902
#define LC1D4S                        2903
#define CLC1SEL3_D4S                  2904
#define LC1D4S0                       2905
#define CLC1SEL3_D4S0                 2906
#define LC1D4S1                       2907
#define CLC1SEL3_D4S1                 2908
#define LC1D4S2                       2909
#define CLC1SEL3_D4S2                 2910
#define LC1D4S3                       2911
#define CLC1SEL3_D4S3                 2912
#define LC1D4S4                       2913
#define CLC1SEL3_D4S4                 2914
#define LC1D4S5                       2915
#define CLC1SEL3_D4S5                 2916
#define LC1D4S6                       2917
#define CLC1SEL3_D4S6                 2918
#define LC1D4S7                       2919
#define CLC1SEL3_D4S7                 2920
#define CLC1GLS0                      2921
#define CLC1GLS0_D1N                  2922
#define LC1G1D1N                      2923
#define CLC1GLS0_D1T                  2924
#define LC1G1D1T                      2925
#define LC1G1D2N                      2926
#define CLC1GLS0_D2N                  2927
#define LC1G1D2T                      2928
#define CLC1GLS0_D2T                  2929
#define CLC1GLS0_D3N                  2930
#define LC1G1D3N                      2931
#define CLC1GLS0_D3T                  2932
#define LC1G1D3T                      2933
#define CLC1GLS0_D4N                  2934
#define LC1G1D4N                      2935
#define CLC1GLS0_D4T                  2936
#define LC1G1D4T                      2937
#define CLC1GLS1                      2938
#define CLC1GLS1_D1N                  2939
#define LC1G2D1N                      2940
#define LC1G2D1T                      2941
#define CLC1GLS1_D1T                  2942
#define CLC1GLS1_D2N                  2943
#define LC1G2D2N                      2944
#define LC1G2D2T                      2945
#define CLC1GLS1_D2T                  2946
#define CLC1GLS1_D3N                  2947
#define LC1G2D3N                      2948
#define LC1G2D3T                      2949
#define CLC1GLS1_D3T                  2950
#define CLC1GLS1_D4N                  2951
#define LC1G2D4N                      2952
#define LC1G2D4T                      2953
#define CLC1GLS1_D4T                  2954
#define CLC1GLS2                      2955
#define CLC1GLS2_D1N                  2956
#define LC1G3D1N                      2957
#define LC1G3D1T                      2958
#define CLC1GLS2_D1T                  2959
#define LC1G3D2N                      2960
#define CLC1GLS2_D2N                  2961
#define LC1G3D2T                      2962
#define CLC1GLS2_D2T                  2963
#define CLC1GLS2_D3N                  2964
#define LC1G3D3N                      2965
#define LC1G3D3T                      2966
#define CLC1GLS2_D3T                  2967
#define LC1G3D4N                      2968
#define CLC1GLS2_D4N                  2969
#define LC1G3D4T                      2970
#define CLC1GLS2_D4T                  2971
#define CLC1GLS3                      2972
#define LC1G4D1N                      2973
#define CLC1GLS3_G4D1N                2974
#define LC1G4D1T                      2975
#define CLC1GLS3_G4D1T                2976
#define CLC1GLS3_G4D2N                2977
#define LC1G4D2N                      2978
#define CLC1GLS3_G4D2T                2979
#define LC1G4D2T                      2980
#define LC1G4D3N                      2981
#define CLC1GLS3_G4D3N                2982
#define LC1G4D3T                      2983
#define CLC1GLS3_G4D3T                2984
#define CLC1GLS3_G4D4N                2985
#define LC1G4D4N                      2986
#define CLC1GLS3_G4D4T                2987
#define LC1G4D4T                      2988
#define CLC2CON                       2989
#define LC2MODE0                      2990
#define CLC2CON_MODE                  2991
#define LC2MODE                       2992
#define CLC2CON_MODE0                 2993
#define LC2MODE1                      2994
#define CLC2CON_MODE1                 2995
#define LC2MODE2                      2996
#define CLC2CON_MODE2                 2997
#define LC2INTN                       2998
#define CLC2CON_INTN                  2999
#define LC2INTP                       3000
#define CLC2CON_INTP                  3001
#define CLC2CON_OUT                   3002
#define LC2OUT                        3003
#define CLC2CON_EN                    3004
#define LC2EN                         3005
#define CLC2POL                       3006
#define LC2G1POL                      3007
#define CLC2POL_G1POL                 3008
#define LC2G2POL                      3009
#define CLC2POL_G2POL                 3010
#define LC2G3POL                      3011
#define CLC2POL_G3POL                 3012
#define LC2G4POL                      3013
#define CLC2POL_G4POL                 3014
#define CLC2POL_POL                   3015
#define LC2POL                        3016
#define CLC2SEL0                      3017
#define CLC2SEL0_D1S                  3018
#define LC2D1S                        3019
#define LC2D1S0                       3020
#define CLC2SEL0_D1S0                 3021
#define LC2D1S1                       3022
#define CLC2SEL0_D1S1                 3023
#define LC2D1S2                       3024
#define CLC2SEL0_D1S2                 3025
#define LC2D1S3                       3026
#define CLC2SEL0_D1S3                 3027
#define LC2D1S4                       3028
#define CLC2SEL0_D1S4                 3029
#define LC2D1S5                       3030
#define CLC2SEL0_D1S5                 3031
#define LC2D1S6                       3032
#define CLC2SEL0_D1S6                 3033
#define LC2D1S7                       3034
#define CLC2SEL0_D1S7                 3035
#define CLC2SEL1                      3036
#define LC2D2S0                       3037
#define LC2D2S                        3038
#define CLC2SEL1_D2S                  3039
#define CLC2SEL1_D2S0                 3040
#define LC2D2S1                       3041
#define CLC2SEL1_D2S1                 3042
#define LC2D2S2                       3043
#define CLC2SEL1_D2S2                 3044
#define LC2D2S3                       3045
#define CLC2SEL1_D2S3                 3046
#define LC2D2S4                       3047
#define CLC2SEL1_D2S4                 3048
#define LC2D2S5                       3049
#define CLC2SEL1_D2S5                 3050
#define LC2D2S6                       3051
#define CLC2SEL1_D2S6                 3052
#define LC2D2S7                       3053
#define CLC2SEL1_D2S7                 3054
#define CLC2SEL2                      3055
#define CLC2SEL2_D3S0                 3056
#define LC2D3S                        3057
#define CLC2SEL2_D3S                  3058
#define LC2D3S0                       3059
#define CLC2SEL2_D3S1                 3060
#define LC2D3S1                       3061
#define CLC2SEL2_D3S2                 3062
#define LC2D3S2                       3063
#define CLC2SEL2_D3S3                 3064
#define LC2D3S3                       3065
#define CLC2SEL2_D3S4                 3066
#define LC2D3S4                       3067
#define CLC2SEL2_D3S5                 3068
#define LC2D3S5                       3069
#define CLC2SEL2_D3S6                 3070
#define LC2D3S6                       3071
#define CLC2SEL2_D3S7                 3072
#define LC2D3S7                       3073
#define CLC2SEL3                      3074
#define LC2D4S                        3075
#define CLC2SEL3_D4S0                 3076
#define LC2D4S0                       3077
#define CLC2SEL3_D4S                  3078
#define CLC2SEL3_D4S1                 3079
#define LC2D4S1                       3080
#define CLC2SEL3_D4S2                 3081
#define LC2D4S2                       3082
#define CLC2SEL3_D4S3                 3083
#define LC2D4S3                       3084
#define CLC2SEL3_D4S4                 3085
#define LC2D4S4                       3086
#define CLC2SEL3_D4S5                 3087
#define LC2D4S5                       3088
#define CLC2SEL3_D4S6                 3089
#define LC2D4S6                       3090
#define CLC2SEL3_D4S7                 3091
#define LC2D4S7                       3092
#define CLC2GLS0                      3093
#define LC2G1D1N                      3094
#define CLC2GLS0_D1N                  3095
#define CLC2GLS0_D1T                  3096
#define LC2G1D1T                      3097
#define LC2G1D2N                      3098
#define CLC2GLS0_D2N                  3099
#define CLC2GLS0_D2T                  3100
#define LC2G1D2T                      3101
#define LC2G1D3N                      3102
#define CLC2GLS0_D3N                  3103
#define CLC2GLS0_D3T                  3104
#define LC2G1D3T                      3105
#define LC2G1D4N                      3106
#define CLC2GLS0_D4N                  3107
#define CLC2GLS0_D4T                  3108
#define LC2G1D4T                      3109
#define CLC2GLS1                      3110
#define CLC2GLS1_D1N                  3111
#define LC2G2D1N                      3112
#define CLC2GLS1_D1T                  3113
#define LC2G2D1T                      3114
#define CLC2GLS1_D2N                  3115
#define LC2G2D2N                      3116
#define CLC2GLS1_D2T                  3117
#define LC2G2D2T                      3118
#define LC2G2D3N                      3119
#define CLC2GLS1_D3N                  3120
#define LC2G2D3T                      3121
#define CLC2GLS1_D3T                  3122
#define LC2G2D4N                      3123
#define CLC2GLS1_D4N                  3124
#define LC2G2D4T                      3125
#define CLC2GLS1_D4T                  3126
#define CLC2GLS2                      3127
#define LC2G3D1N                      3128
#define CLC2GLS2_D1N                  3129
#define CLC2GLS2_D1T                  3130
#define LC2G3D1T                      3131
#define CLC2GLS2_D2N                  3132
#define LC2G3D2N                      3133
#define LC2G3D2T                      3134
#define CLC2GLS2_D2T                  3135
#define CLC2GLS2_D3N                  3136
#define LC2G3D3N                      3137
#define CLC2GLS2_D3T                  3138
#define LC2G3D3T                      3139
#define CLC2GLS2_D4N                  3140
#define LC2G3D4N                      3141
#define LC2G3D4T                      3142
#define CLC2GLS2_D4T                  3143
#define CLC2GLS3                      3144
#define LC2G4D1N                      3145
#define CLC2GLS3_G4D1N                3146
#define CLC2GLS3_G4D1T                3147
#define LC2G4D1T                      3148
#define CLC2GLS3_G4D2N                3149
#define LC2G4D2N                      3150
#define LC2G4D2T                      3151
#define CLC2GLS3_G4D2T                3152
#define CLC2GLS3_G4D3N                3153
#define LC2G4D3N                      3154
#define CLC2GLS3_G4D3T                3155
#define LC2G4D3T                      3156
#define LC2G4D4N                      3157
#define CLC2GLS3_G4D4N                3158
#define CLC2GLS3_G4D4T                3159
#define LC2G4D4T                      3160
#define CLC3CON                       3161
#define LC3MODE                       3162
#define CLC3CON_MODE0                 3163
#define LC3MODE0                      3164
#define CLC3CON_MODE                  3165
#define CLC3CON_MODE1                 3166
#define LC3MODE1                      3167
#define CLC3CON_MODE2                 3168
#define LC3MODE2                      3169
#define LC3INTN                       3170
#define CLC3CON_INTN                  3171
#define LC3INTP                       3172
#define CLC3CON_INTP                  3173
#define LC3OUT                        3174
#define CLC3CON_OUT                   3175
#define LC3EN                         3176
#define CLC3CON_EN                    3177
#define CLC3POL                       3178
#define LC3G1POL                      3179
#define CLC3POL_G1POL                 3180
#define LC3G2POL                      3181
#define CLC3POL_G2POL                 3182
#define CLC3POL_G3POL                 3183
#define LC3G3POL                      3184
#define LC3G4POL                      3185
#define CLC3POL_G4POL                 3186
#define LC3POL                        3187
#define CLC3POL_POL                   3188
#define CLC3SEL0                      3189
#define LC3D1S                        3190
#define CLC3SEL0_D1S                  3191
#define LC3D1S0                       3192
#define CLC3SEL0_D1S0                 3193
#define LC3D1S1                       3194
#define CLC3SEL0_D1S1                 3195
#define LC3D1S2                       3196
#define CLC3SEL0_D1S2                 3197
#define LC3D1S3                       3198
#define CLC3SEL0_D1S3                 3199
#define LC3D1S4                       3200
#define CLC3SEL0_D1S4                 3201
#define LC3D1S5                       3202
#define CLC3SEL0_D1S5                 3203
#define LC3D1S6                       3204
#define CLC3SEL0_D1S6                 3205
#define LC3D1S7                       3206
#define CLC3SEL0_D1S7                 3207
#define CLC3SEL1                      3208
#define LC3D2S0                       3209
#define LC3D2S                        3210
#define CLC3SEL1_D2S0                 3211
#define CLC3SEL1_D2S                  3212
#define LC3D2S1                       3213
#define CLC3SEL1_D2S1                 3214
#define LC3D2S2                       3215
#define CLC3SEL1_D2S2                 3216
#define LC3D2S3                       3217
#define CLC3SEL1_D2S3                 3218
#define LC3D2S4                       3219
#define CLC3SEL1_D2S4                 3220
#define LC3D2S5                       3221
#define CLC3SEL1_D2S5                 3222
#define LC3D2S6                       3223
#define CLC3SEL1_D2S6                 3224
#define LC3D2S7                       3225
#define CLC3SEL1_D2S7                 3226
#define CLC3SEL2                      3227
#define LC3D3S                        3228
#define CLC3SEL2_D3S                  3229
#define LC3D3S0                       3230
#define CLC3SEL2_D3S0                 3231
#define LC3D3S1                       3232
#define CLC3SEL2_D3S1                 3233
#define LC3D3S2                       3234
#define CLC3SEL2_D3S2                 3235
#define LC3D3S3                       3236
#define CLC3SEL2_D3S3                 3237
#define LC3D3S4                       3238
#define CLC3SEL2_D3S4                 3239
#define LC3D3S5                       3240
#define CLC3SEL2_D3S5                 3241
#define LC3D3S6                       3242
#define CLC3SEL2_D3S6                 3243
#define LC3D3S7                       3244
#define CLC3SEL2_D3S7                 3245
#define CLC3SEL3                      3246
#define CLC3SEL3_D4S                  3247
#define LC3D4S0                       3248
#define LC3D4S                        3249
#define CLC3SEL3_D4S0                 3250
#define LC3D4S1                       3251
#define CLC3SEL3_D4S1                 3252
#define LC3D4S2                       3253
#define CLC3SEL3_D4S2                 3254
#define LC3D4S3                       3255
#define CLC3SEL3_D4S3                 3256
#define LC3D4S4                       3257
#define CLC3SEL3_D4S4                 3258
#define LC3D4S5                       3259
#define CLC3SEL3_D4S5                 3260
#define LC3D4S6                       3261
#define CLC3SEL3_D4S6                 3262
#define LC3D4S7                       3263
#define CLC3SEL3_D4S7                 3264
#define CLC3GLS0                      3265
#define CLC3GLS0_D1N                  3266
#define LC3G1D1N                      3267
#define LC3G1D1T                      3268
#define CLC3GLS0_D1T                  3269
#define LC3G1D2N                      3270
#define CLC3GLS0_D2N                  3271
#define CLC3GLS0_D2T                  3272
#define LC3G1D2T                      3273
#define CLC3GLS0_D3N                  3274
#define LC3G1D3N                      3275
#define LC3G1D3T                      3276
#define CLC3GLS0_D3T                  3277
#define CLC3GLS0_D4N                  3278
#define LC3G1D4N                      3279
#define CLC3GLS0_D4T                  3280
#define LC3G1D4T                      3281
#define CLC3GLS1                      3282
#define LC3G2D1N                      3283
#define CLC3GLS1_D1N                  3284
#define CLC3GLS1_D1T                  3285
#define LC3G2D1T                      3286
#define LC3G2D2N                      3287
#define CLC3GLS1_D2N                  3288
#define LC3G2D2T                      3289
#define CLC3GLS1_D2T                  3290
#define LC3G2D3N                      3291
#define CLC3GLS1_D3N                  3292
#define CLC3GLS1_D3T                  3293
#define LC3G2D3T                      3294
#define LC3G2D4N                      3295
#define CLC3GLS1_D4N                  3296
#define LC3G2D4T                      3297
#define CLC3GLS1_D4T                  3298
#define CLC3GLS2                      3299
#define LC3G3D1N                      3300
#define CLC3GLS2_D1N                  3301
#define LC3G3D1T                      3302
#define CLC3GLS2_D1T                  3303
#define CLC3GLS2_D2N                  3304
#define LC3G3D2N                      3305
#define CLC3GLS2_D2T                  3306
#define LC3G3D2T                      3307
#define CLC3GLS2_D3N                  3308
#define LC3G3D3N                      3309
#define LC3G3D3T                      3310
#define CLC3GLS2_D3T                  3311
#define CLC3GLS2_D4N                  3312
#define LC3G3D4N                      3313
#define CLC3GLS2_D4T                  3314
#define LC3G3D4T                      3315
#define CLC3GLS3                      3316
#define LC3G4D1N                      3317
#define CLC3GLS3_G4D1N                3318
#define LC3G4D1T                      3319
#define CLC3GLS3_G4D1T                3320
#define LC3G4D2N                      3321
#define CLC3GLS3_G4D2N                3322
