tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18876_tdd.h
#define CLC3GLS3_G4D2T                3323
#define LC3G4D2T                      3324
#define LC3G4D3N                      3325
#define CLC3GLS3_G4D3N                3326
#define CLC3GLS3_G4D3T                3327
#define LC3G4D3T                      3328
#define LC3G4D4N                      3329
#define CLC3GLS3_G4D4N                3330
#define LC3G4D4T                      3331
#define CLC3GLS3_G4D4T                3332
#define CLC4CON                       3333
#define LC4MODE                       3334
#define CLC4CON_MODE                  3335
#define LC4MODE0                      3336
#define CLC4CON_MODE0                 3337
#define LC4MODE1                      3338
#define CLC4CON_MODE1                 3339
#define LC4MODE2                      3340
#define CLC4CON_MODE2                 3341
#define LC4INTN                       3342
#define CLC4CON_INTN                  3343
#define CLC4CON_INTP                  3344
#define LC4INTP                       3345
#define CLC4CON_OUT                   3346
#define LC4OUT                        3347
#define CLC4CON_EN                    3348
#define LC4EN                         3349
#define CLC4POL                       3350
#define CLC4POL_G1POL                 3351
#define LC4G1POL                      3352
#define CLC4POL_G2POL                 3353
#define LC4G2POL                      3354
#define CLC4POL_G3POL                 3355
#define LC4G3POL                      3356
#define LC4G4POL                      3357
#define CLC4POL_G4POL                 3358
#define LC4POL                        3359
#define CLC4POL_POL                   3360
#define CLC4SEL0                      3361
#define LC4D1S0                       3362
#define CLC4SEL0_D1S                  3363
#define CLC4SEL0_D1S0                 3364
#define LC4D1S                        3365
#define LC4D1S1                       3366
#define CLC4SEL0_D1S1                 3367
#define LC4D1S2                       3368
#define CLC4SEL0_D1S2                 3369
#define LC4D1S3                       3370
#define CLC4SEL0_D1S3                 3371
#define LC4D1S4                       3372
#define CLC4SEL0_D1S4                 3373
#define LC4D1S5                       3374
#define CLC4SEL0_D1S5                 3375
#define LC4D1S6                       3376
#define CLC4SEL0_D1S6                 3377
#define LC4D1S7                       3378
#define CLC4SEL0_D1S7                 3379
#define CLC4SEL1                      3380
#define CLC4SEL1_D2S                  3381
#define CLC4SEL1_D2S0                 3382
#define LC4D2S                        3383
#define LC4D2S0                       3384
#define CLC4SEL1_D2S1                 3385
#define LC4D2S1                       3386
#define CLC4SEL1_D2S2                 3387
#define LC4D2S2                       3388
#define CLC4SEL1_D2S3                 3389
#define LC4D2S3                       3390
#define CLC4SEL1_D2S4                 3391
#define LC4D2S4                       3392
#define CLC4SEL1_D2S5                 3393
#define LC4D2S5                       3394
#define CLC4SEL1_D2S6                 3395
#define LC4D2S6                       3396
#define CLC4SEL1_D2S7                 3397
#define LC4D2S7                       3398
#define CLC4SEL2                      3399
#define CLC4SEL2_D3S                  3400
#define LC4D3S0                       3401
#define LC4D3S                        3402
#define CLC4SEL2_D3S0                 3403
#define LC4D3S1                       3404
#define CLC4SEL2_D3S1                 3405
#define LC4D3S2                       3406
#define CLC4SEL2_D3S2                 3407
#define LC4D3S3                       3408
#define CLC4SEL2_D3S3                 3409
#define LC4D3S4                       3410
#define CLC4SEL2_D3S4                 3411
#define LC4D3S5                       3412
#define CLC4SEL2_D3S5                 3413
#define LC4D3S6                       3414
#define CLC4SEL2_D3S6                 3415
#define LC4D3S7                       3416
#define CLC4SEL2_D3S7                 3417
#define CLC4SEL3                      3418
#define CLC4SEL3_D4S                  3419
#define LC4D4S0                       3420
#define CLC4SEL3_D4S0                 3421
#define LC4D4S                        3422
#define LC4D4S1                       3423
#define CLC4SEL3_D4S1                 3424
#define LC4D4S2                       3425
#define CLC4SEL3_D4S2                 3426
#define LC4D4S3                       3427
#define CLC4SEL3_D4S3                 3428
#define LC4D4S4                       3429
#define CLC4SEL3_D4S4                 3430
#define LC4D4S5                       3431
#define CLC4SEL3_D4S5                 3432
#define LC4D4S6                       3433
#define CLC4SEL3_D4S6                 3434
#define LC4D4S7                       3435
#define CLC4SEL3_D4S7                 3436
#define CLC4GLS0                      3437
#define CLC4GLS0_D1N                  3438
#define LC4G1D1N                      3439
#define CLC4GLS0_D1T                  3440
#define LC4G1D1T                      3441
#define CLC4GLS0_D2N                  3442
#define LC4G1D2N                      3443
#define CLC4GLS0_D2T                  3444
#define LC4G1D2T                      3445
#define CLC4GLS0_D3N                  3446
#define LC4G1D3N                      3447
#define CLC4GLS0_D3T                  3448
#define LC4G1D3T                      3449
#define CLC4GLS0_D4N                  3450
#define LC4G1D4N                      3451
#define CLC4GLS0_D4T                  3452
#define LC4G1D4T                      3453
#define CLC4GLS1                      3454
#define CLC4GLS1_D1N                  3455
#define LC4G2D1N                      3456
#define CLC4GLS1_D1T                  3457
#define LC4G2D1T                      3458
#define LC4G2D2N                      3459
#define CLC4GLS1_D2N                  3460
#define LC4G2D2T                      3461
#define CLC4GLS1_D2T                  3462
#define CLC4GLS1_D3N                  3463
#define LC4G2D3N                      3464
#define LC4G2D3T                      3465
#define CLC4GLS1_D3T                  3466
#define CLC4GLS1_D4N                  3467
#define LC4G2D4N                      3468
#define CLC4GLS1_D4T                  3469
#define LC4G2D4T                      3470
#define CLC4GLS2                      3471
#define CLC4GLS2_D1N                  3472
#define LC4G3D1N                      3473
#define CLC4GLS2_D1T                  3474
#define LC4G3D1T                      3475
#define LC4G3D2N                      3476
#define CLC4GLS2_D2N                  3477
#define LC4G3D2T                      3478
#define CLC4GLS2_D2T                  3479
#define CLC4GLS2_D3N                  3480
#define LC4G3D3N                      3481
#define CLC4GLS2_D3T                  3482
#define LC4G3D3T                      3483
#define LC4G3D4N                      3484
#define CLC4GLS2_D4N                  3485
#define LC4G3D4T                      3486
#define CLC4GLS2_D4T                  3487
#define CLC4GLS3                      3488
#define CLC4GLS3_G4D1N                3489
#define LC4G4D1N                      3490
#define LC4G4D1T                      3491
#define CLC4GLS3_G4D1T                3492
#define LC4G4D2N                      3493
#define CLC4GLS3_G4D2N                3494
#define LC4G4D2T                      3495
#define CLC4GLS3_G4D2T                3496
#define CLC4GLS3_G4D3N                3497
#define LC4G4D3N                      3498
#define CLC4GLS3_G4D3T                3499
#define LC4G4D3T                      3500
#define LC4G4D4N                      3501
#define CLC4GLS3_G4D4N                3502
#define LC4G4D4T                      3503
#define CLC4GLS3_G4D4T                3504
#define PPSLOCK                       3505
#define PPSLOCKED                     3506
#define INTPPS0                       3507
#define INTPPS                        3508
#define INTPPS1                       3509
#define INTPPS2                       3510
#define INTPPS3                       3511
#define T0CKIPPS                      3512
#define T0CKIPPS0                     3513
#define T0CKIPPS1                     3514
#define T0CKIPPS2                     3515
#define T0CKIPPS3                     3516
#define T1CKIPPS0                     3517
#define T1CKIPPS                      3518
#define T1CKIPPS1                     3519
#define T1CKIPPS2                     3520
#define T1CKIPPS3                     3521
#define T1CKIPPS4                     3522
#define T1GPPS0                       3523
#define T1GPPS                        3524
#define T1GPPS1                       3525
#define T1GPPS2                       3526
#define T1GPPS3                       3527
#define T1GPPS4                       3528
#define T3CKIPPS0                     3529
#define T3CKIPPS                      3530
#define T3CKIPPS1                     3531
#define T3CKIPPS2                     3532
#define T3CKIPPS3                     3533
#define T3CKIPPS4                     3534
#define T3GPPS0                       3535
#define T3GPPS                        3536
#define T3GPPS1                       3537
#define T3GPPS2                       3538
#define T3GPPS3                       3539
#define T3GPPS4                       3540
#define T5CKIPPS0                     3541
#define T5CKIPPS                      3542
#define T5CKIPPS1                     3543
#define T5CKIPPS2                     3544
#define T5CKIPPS3                     3545
#define T5CKIPPS4                     3546
#define T5GPPS                        3547
#define T5GPPS0                       3548
#define T5GPPS1                       3549
#define T5GPPS2                       3550
#define T5GPPS3                       3551
#define T5GPPS4                       3552
#define T2AINPPS                      3553
#define T2AINPPS0                     3554
#define T2AINPPS1                     3555
#define T2AINPPS2                     3556
#define T2AINPPS3                     3557
#define T2AINPPS4                     3558
#define T4AINPPS                      3559
#define T4AINPPS0                     3560
#define T4AINPPS1                     3561
#define T4AINPPS2                     3562
#define T4AINPPS3                     3563
#define T4AINPPS4                     3564
#define T6AINPPS0                     3565
#define T6AINPPS                      3566
#define T6AINPPS1                     3567
#define T6AINPPS2                     3568
#define T6AINPPS3                     3569
#define T6AINPPS4                     3570
#define CCP1PPS0                      3571
#define CCP1PPS                       3572
#define CCP1PPS1                      3573
#define CCP1PPS2                      3574
#define CCP1PPS3                      3575
#define CCP1PPS4                      3576
#define CCP2PPS0                      3577
#define CCP2PPS                       3578
#define CCP2PPS1                      3579
#define CCP2PPS2                      3580
#define CCP2PPS3                      3581
#define CCP2PPS4                      3582
#define CCP3PPS0                      3583
#define CCP3PPS                       3584
#define CCP3PPS1                      3585
#define CCP3PPS2                      3586
#define CCP3PPS3                      3587
#define CCP3PPS4                      3588
#define CCP4PPS0                      3589
#define CCP4PPS                       3590
#define CCP4PPS1                      3591
#define CCP4PPS2                      3592
#define CCP4PPS3                      3593
#define CCP4PPS4                      3594
#define CCP5PPS                       3595
#define CCP5PPS0                      3596
#define CCP5PPS1                      3597
#define CCP5PPS2                      3598
#define CCP5PPS3                      3599
#define CCP5PPS4                      3600
#define CCP6PPS                       3601
#define SMT1WINPPS                    3602
#define SMU1WINPPS0                   3603
#define SMU1WINPPS1                   3604
#define SMU1WINPPS2                   3605
#define SMU1WINPPS3                   3606
#define SMU1WINPPS4                   3607
#define SMT1SIGPPS                    3608
#define SMU1SIGPPS0                   3609
#define SMU1SIGPPS1                   3610
#define SMU1SIGPPS2                   3611
#define SMU1SIGPPS3                   3612
#define SMU1SIGPPS4                   3613
#define SMT2WINPPS                    3614
#define SMU2WINPPS0                   3615
#define SMU2WINPPS1                   3616
#define SMU2WINPPS2                   3617
#define SMU2WINPPS3                   3618
#define SMU2WINPPS4                   3619
#define SMT2SIGPPS                    3620
#define SMU2SIGPPS0                   3621
#define SMU2SIGPPS1                   3622
#define SMU2SIGPPS2                   3623
#define SMU2SIGPPS3                   3624
#define SMU2SIGPPS4                   3625
#define CWG1PPS0                      3626
#define CWG1PPS                       3627
#define CWG1PPS1                      3628
#define CWG1PPS2                      3629
#define CWG1PPS3                      3630
#define CWG1PPS4                      3631
#define CWG2PPS0                      3632
#define CWG2PPS                       3633
#define CWG2PPS1                      3634
#define CWG2PPS2                      3635
#define CWG2PPS3                      3636
#define CWG2PPS4                      3637
#define CWG3PPS0                      3638
#define CWG3PPS                       3639
#define CWG3PPS1                      3640
#define CWG3PPS2                      3641
#define CWG3PPS3                      3642
#define CWG3PPS4                      3643
#define MDCARLPPS                     3644
#define MDCARLPPS0                    3645
#define MDCARLPPS1                    3646
#define MDCARLPPS2                    3647
#define MDCARLPPS3                    3648
#define MDCARLPPS4                    3649
#define MDCARHPPS0                    3650
#define MDCARHPPS                     3651
#define MDCARHPPS1                    3652
#define MDCARHPPS2                    3653
#define MDCARHPPS3                    3654
#define MDCARHPPS4                    3655
#define MDSRCPPS0                     3656
#define MDSRCPPS                      3657
#define MDSRCPPS1                     3658
#define MDSRCPPS2                     3659
#define MDSRCPPS3                     3660
#define MDSRCPPS4                     3661
#define CLCIN0PPS                     3662
#define CLCIN0PPS0                    3663
#define CLCIN0PPS1                    3664
#define CLCIN0PPS2                    3665
#define CLCIN0PPS3                    3666
#define CLCIN0PPS4                    3667
#define CLCIN1PPS                     3668
#define CLCIN1PPS0                    3669
#define CLCIN1PPS1                    3670
#define CLCIN1PPS2                    3671
#define CLCIN1PPS3                    3672
#define CLCIN1PPS4                    3673
#define CLCIN2PPS                     3674
#define CLCIN2PPS0                    3675
#define CLCIN2PPS1                    3676
#define CLCIN2PPS2                    3677
#define CLCIN2PPS3                    3678
#define CLCIN2PPS4                    3679
#define CLCIN3PPS                     3680
#define CLCIN3PPS0                    3681
#define CLCIN3PPS1                    3682
#define CLCIN3PPS2                    3683
#define CLCIN3PPS3                    3684
#define CLCIN3PPS4                    3685
#define ADCACTPPS                     3686
#define ADCACTPPS0                    3687
#define ADCACTPPS1                    3688
#define ADCACTPPS2                    3689
#define ADCACTPPS3                    3690
#define ADCACTPPS4                    3691
#define SSP1CLKPPS                    3692
#define SSP1CLKPPS0                   3693
#define SSP1CLKPPS1                   3694
#define SSP1CLKPPS2                   3695
#define SSP1CLKPPS3                   3696
#define SSP1CLKPPS4                   3697
#define SSP1DATPPS                    3698
#define SSP1DATPPS0                   3699
#define SSP1DATPPS1                   3700
#define SSP1DATPPS2                   3701
#define SSP1DATPPS3                   3702
#define SSP1DATPPS4                   3703
#define SSP1SSPPS                     3704
#define SSP1SSPPS0                    3705
#define SSP1SSPPS1                    3706
#define SSP1SSPPS2                    3707
#define SSP1SSPPS3                    3708
#define SSP1SSPPS4                    3709
#define SSP2CLKPPS                    3710
#define SSP2CLKPPS0                   3711
#define SSP2CLKPPS1                   3712
#define SSP2CLKPPS2                   3713
#define SSP2CLKPPS3                   3714
#define SSP2CLKPPS4                   3715
#define SSP2DATPPS                    3716
#define SSP2DATPPS0                   3717
#define SSP2DATPPS1                   3718
#define SSP2DATPPS2                   3719
#define SSP2DATPPS3                   3720
#define SSP2DATPPS4                   3721
#define SSP2SSPPS                     3722
#define SSP2SSPPS0                    3723
#define SSP2SSPPS1                    3724
#define SSP2SSPPS2                    3725
#define SSP2SSPPS3                    3726
#define SSP2SSPPS4                    3727
#define RXPPS                         3728
#define RXPPS0                        3729
#define RXPPS1                        3730
#define RXPPS2                        3731
#define RXPPS3                        3732
#define RXPPS4                        3733
#define TXPPS                         3734
#define TXPPS0                        3735
#define TXPPS1                        3736
#define TXPPS2                        3737
#define TXPPS3                        3738
#define TXPPS4                        3739
#define RA0PPS                        3740
#define RA0PPS0                       3741
#define RA0PPS1                       3742
#define RA0PPS2                       3743
#define RA0PPS3                       3744
#define RA0PPS4                       3745
#define RA0PPS5                       3746
#define RA1PPS                        3747
#define RA1PPS0                       3748
#define RA1PPS1                       3749
#define RA1PPS2                       3750
#define RA1PPS3                       3751
#define RA1PPS4                       3752
#define RA1PPS5                       3753
#define RA2PPS                        3754
#define RA2PPS0                       3755
#define RA2PPS1                       3756
#define RA2PPS2                       3757
#define RA2PPS3                       3758
#define RA2PPS4                       3759
#define RA2PPS5                       3760
#define RA3PPS                        3761
#define RA3PPS0                       3762
#define RA3PPS1                       3763
#define RA3PPS2                       3764
#define RA3PPS3                       3765
#define RA3PPS4                       3766
#define RA3PPS5                       3767
#define RA4PPS                        3768
#define RA4PPS0                       3769
#define RA4PPS1                       3770
#define RA4PPS2                       3771
#define RA4PPS3                       3772
#define RA4PPS4                       3773
#define RA4PPS5                       3774
#define RA5PPS                        3775
#define RA5PPS0                       3776
#define RA5PPS1                       3777
#define RA5PPS2                       3778
#define RA5PPS3                       3779
#define RA5PPS4                       3780
#define RA5PPS5                       3781
#define RA6PPS                        3782
#define RA6PPS0                       3783
#define RA6PPS1                       3784
#define RA6PPS2                       3785
#define RA6PPS3                       3786
#define RA6PPS4                       3787
#define RA6PPS5                       3788
#define RA7PPS                        3789
#define RA7PPS0                       3790
#define RA7PPS1                       3791
#define RA7PPS2                       3792
#define RA7PPS3                       3793
#define RA7PPS4                       3794
#define RA7PPS5                       3795
#define RB0PPS                        3796
#define RB0PPS0                       3797
#define RB0PPS1                       3798
#define RB0PPS2                       3799
#define RB0PPS3                       3800
#define RB0PPS4                       3801
#define RB0PPS5                       3802
#define RB1PPS                        3803
#define RB1PPS0                       3804
#define RB1PPS1                       3805
#define RB1PPS2                       3806
#define RB1PPS3                       3807
#define RB1PPS4                       3808
#define RB1PPS5                       3809
#define RB2PPS                        3810
#define RB2PPS0                       3811
#define RB2PPS1                       3812
#define RB2PPS2                       3813
#define RB2PPS3                       3814
#define RB2PPS4                       3815
#define RB2PPS5                       3816
#define RB3PPS                        3817
#define RB3PPS0                       3818
#define RB3PPS1                       3819
#define RB3PPS2                       3820
#define RB3PPS3                       3821
#define RB3PPS4                       3822
#define RB3PPS5                       3823
#define RB4PPS                        3824
#define RB4PPS0                       3825
#define RB4PPS1                       3826
#define RB4PPS2                       3827
#define RB4PPS3                       3828
#define RB4PPS4                       3829
#define RB4PPS5                       3830
#define RB5PPS                        3831
#define RB5PPS0                       3832
#define RB5PPS1                       3833
#define RB5PPS2                       3834
#define RB5PPS3                       3835
#define RB5PPS4                       3836
#define RB5PPS5                       3837
#define RB6PPS                        3838
#define RB6PPS0                       3839
#define RB6PPS1                       3840
#define RB6PPS2                       3841
#define RB6PPS3                       3842
#define RB6PPS4                       3843
#define RB6PPS5                       3844
#define RB7PPS                        3845
#define RB7PPS0                       3846
#define RB7PPS1                       3847
#define RB7PPS2                       3848
#define RB7PPS3                       3849
#define RB7PPS4                       3850
#define RB7PPS5                       3851
#define RC0PPS                        3852
#define RC0PPS0                       3853
#define RC0PPS1                       3854
#define RC0PPS2                       3855
#define RC0PPS3                       3856
#define RC0PPS4                       3857
#define RC0PPS5                       3858
#define RC1PPS                        3859
#define RC1PPS0                       3860
#define RC1PPS1                       3861
#define RC1PPS2                       3862
#define RC1PPS3                       3863
#define RC1PPS4                       3864
#define RC1PPS5                       3865
#define RC2PPS                        3866
#define RC2PPS0                       3867
#define RC2PPS1                       3868
#define RC2PPS2                       3869
#define RC2PPS3                       3870
#define RC2PPS4                       3871
#define RC2PPS5                       3872
#define RC3PPS                        3873
#define RC3PPS0                       3874
#define RC3PPS1                       3875
#define RC3PPS2                       3876
#define RC3PPS3                       3877
#define RC3PPS4                       3878
#define RC3PPS5                       3879
#define RC4PPS                        3880
