tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18876_tdd.h
#define RC4PPS0                       3881
#define RC4PPS1                       3882
#define RC4PPS2                       3883
#define RC4PPS3                       3884
#define RC4PPS4                       3885
#define RC4PPS5                       3886
#define RC5PPS                        3887
#define RC5PPS0                       3888
#define RC5PPS1                       3889
#define RC5PPS2                       3890
#define RC5PPS3                       3891
#define RC5PPS4                       3892
#define RC5PPS5                       3893
#define RC6PPS                        3894
#define RC6PPS0                       3895
#define RC6PPS1                       3896
#define RC6PPS2                       3897
#define RC6PPS3                       3898
#define RC6PPS4                       3899
#define RC6PPS5                       3900
#define RC7PPS                        3901
#define RC7PPS0                       3902
#define RC7PPS1                       3903
#define RC7PPS2                       3904
#define RC7PPS3                       3905
#define RC7PPS4                       3906
#define RC7PPS5                       3907
#define RD0PPS                        3908
#define RD0PPS0                       3909
#define RD0PPS1                       3910
#define RD0PPS2                       3911
#define RD0PPS3                       3912
#define RD0PPS4                       3913
#define RD0PPS5                       3914
#define RD1PPS                        3915
#define RD1PPS0                       3916
#define RD1PPS1                       3917
#define RD1PPS2                       3918
#define RD1PPS3                       3919
#define RD1PPS4                       3920
#define RD1PPS5                       3921
#define RD2PPS                        3922
#define RD2PPS0                       3923
#define RD2PPS1                       3924
#define RD2PPS2                       3925
#define RD2PPS3                       3926
#define RD2PPS4                       3927
#define RD2PPS5                       3928
#define RD3PPS                        3929
#define RD3PPS0                       3930
#define RD3PPS1                       3931
#define RD3PPS2                       3932
#define RD3PPS3                       3933
#define RD3PPS4                       3934
#define RD3PPS5                       3935
#define RD4PPS                        3936
#define RD4PPS0                       3937
#define RD4PPS1                       3938
#define RD4PPS2                       3939
#define RD4PPS3                       3940
#define RD4PPS4                       3941
#define RD4PPS5                       3942
#define RD5PPS                        3943
#define RD5PPS0                       3944
#define RD5PPS1                       3945
#define RD5PPS2                       3946
#define RD5PPS3                       3947
#define RD5PPS4                       3948
#define RD5PPS5                       3949
#define RD6PPS                        3950
#define RD6PPS0                       3951
#define RD6PPS1                       3952
#define RD6PPS2                       3953
#define RD6PPS3                       3954
#define RD6PPS4                       3955
#define RD6PPS5                       3956
#define RD7PPS                        3957
#define RD7PPS0                       3958
#define RD7PPS1                       3959
#define RD7PPS2                       3960
#define RD7PPS3                       3961
#define RD7PPS4                       3962
#define RD7PPS5                       3963
#define RE0PPS                        3964
#define RE0PPS0                       3965
#define RE0PPS1                       3966
#define RE0PPS2                       3967
#define RE0PPS3                       3968
#define RE0PPS4                       3969
#define RE0PPS5                       3970
#define RE1PPS                        3971
#define RE1PPS0                       3972
#define RE1PPS1                       3973
#define RE1PPS2                       3974
#define RE1PPS3                       3975
#define RE1PPS4                       3976
#define RE1PPS5                       3977
#define RE2PPS                        3978
#define RE2PPS0                       3979
#define RE2PPS1                       3980
#define RE2PPS2                       3981
#define RE2PPS3                       3982
#define RE2PPS4                       3983
#define RE2PPS5                       3984
#define ANSELA                        3985
#define ANSA0                         3986
#define ANSA1                         3987
#define ANSA2                         3988
#define ANSA3                         3989
#define ANSA4                         3990
#define ANSA5                         3991
#define ANSA6                         3992
#define ANSA7                         3993
#define WPUA                          3994
#define WPUA0                         3995
#define WPUA1                         3996
#define WPUA2                         3997
#define WPUA3                         3998
#define WPUA4                         3999
#define WPUA5                         4000
#define WPUA6                         4001
#define WPUA7                         4002
#define ODCONA                        4003
#define ODCA0                         4004
#define ODCA1                         4005
#define ODCA2                         4006
#define ODCA3                         4007
#define ODCA4                         4008
#define ODCA5                         4009
#define ODCA6                         4010
#define ODCA7                         4011
#define SLRCONA                       4012
#define SLRA0                         4013
#define SLRA1                         4014
#define SLRA2                         4015
#define SLRA3                         4016
#define SLRA4                         4017
#define SLRA5                         4018
#define SLRA6                         4019
#define SLRA7                         4020
#define INLVLA                        4021
#define INLVLA0                       4022
#define INLVLA1                       4023
#define INLVLA2                       4024
#define INLVLA3                       4025
#define INLVLA4                       4026
#define INLVLA5                       4027
#define INLVLA6                       4028
#define INLVLA7                       4029
#define IOCAP                         4030
#define IOCAP0                        4031
#define IOCAP1                        4032
#define IOCAP2                        4033
#define IOCAP3                        4034
#define IOCAP4                        4035
#define IOCAP5                        4036
#define IOCAP6                        4037
#define IOCAP7                        4038
#define IOCAN                         4039
#define IOCAN0                        4040
#define IOCAN1                        4041
#define IOCAN2                        4042
#define IOCAN3                        4043
#define IOCAN4                        4044
#define IOCAN5                        4045
#define IOCAN6                        4046
#define IOCAN7                        4047
#define IOCAF                         4048
#define IOCAF0                        4049
#define IOCAF1                        4050
#define IOCAF2                        4051
#define IOCAF3                        4052
#define IOCAF4                        4053
#define IOCAF5                        4054
#define IOCAF6                        4055
#define IOCAF7                        4056
#define CCDNA                         4057
#define CCDNA0                        4058
#define CCDNA1                        4059
#define CCDNA2                        4060
#define CCDNA3                        4061
#define CCDNA4                        4062
#define CCDNA5                        4063
#define CCDNA6                        4064
#define CCDNA7                        4065
#define CCDPA                         4066
#define CCDPA0                        4067
#define CCDPA1                        4068
#define CCDPA2                        4069
#define CCDPA3                        4070
#define CCDPA4                        4071
#define CCDPA5                        4072
#define CCDPA6                        4073
#define CCDPA7                        4074
#define ANSELB                        4075
#define ANSB0                         4076
#define ANSB1                         4077
#define ANSB2                         4078
#define ANSB3                         4079
#define ANSB4                         4080
#define ANSB5                         4081
#define ANSB6                         4082
#define ANSB7                         4083
#define WPUB                          4084
#define WPUB0                         4085
#define WPUB1                         4086
#define WPUB2                         4087
#define WPUB3                         4088
#define WPUB4                         4089
#define WPUB5                         4090
#define WPUB6                         4091
#define WPUB7                         4092
#define ODCONB                        4093
#define ODCB0                         4094
#define ODCB1                         4095
#define ODCB2                         4096
#define ODCB3                         4097
#define ODCB4                         4098
#define ODCB5                         4099
#define ODCB6                         4100
#define ODCB7                         4101
#define SLRCONB                       4102
#define SLRB0                         4103
#define SLRB1                         4104
#define SLRB2                         4105
#define SLRB3                         4106
#define SLRB4                         4107
#define SLRB5                         4108
#define SLRB6                         4109
#define SLRB7                         4110
#define INLVLB                        4111
#define INLVLB0                       4112
#define INLVLB1                       4113
#define INLVLB2                       4114
#define INLVLB3                       4115
#define INLVLB4                       4116
#define INLVLB5                       4117
#define INLVLB6                       4118
#define INLVLB7                       4119
#define IOCBP                         4120
#define IOCBP0                        4121
#define IOCBP1                        4122
#define IOCBP2                        4123
#define IOCBP3                        4124
#define IOCBP4                        4125
#define IOCBP5                        4126
#define IOCBP6                        4127
#define IOCBP7                        4128
#define IOCBN                         4129
#define IOCBN0                        4130
#define IOCBN1                        4131
#define IOCBN2                        4132
#define IOCBN3                        4133
#define IOCBN4                        4134
#define IOCBN5                        4135
#define IOCBN6                        4136
#define IOCBN7                        4137
#define IOCBF                         4138
#define IOCBF0                        4139
#define IOCBF1                        4140
#define IOCBF2                        4141
#define IOCBF3                        4142
#define IOCBF4                        4143
#define IOCBF5                        4144
#define IOCBF6                        4145
#define IOCBF7                        4146
#define CCDNB                         4147
#define CCDNB0                        4148
#define CCDNB1                        4149
#define CCDNB2                        4150
#define CCDNB3                        4151
#define CCDNB4                        4152
#define CCDNB5                        4153
#define CCDNB6                        4154
#define CCDNB7                        4155
#define CCDPB                         4156
#define CCDPB0                        4157
#define CCDPB1                        4158
#define CCDPB2                        4159
#define CCDPB3                        4160
#define CCDPB4                        4161
#define CCDPB5                        4162
#define CCDPB6                        4163
#define CCDPB7                        4164
#define ANSELC                        4165
#define ANSC0                         4166
#define ANSC1                         4167
#define ANSC2                         4168
#define ANSC3                         4169
#define ANSC4                         4170
#define ANSC5                         4171
#define ANSC6                         4172
#define ANSC7                         4173
#define WPUC                          4174
#define WPUC0                         4175
#define WPUC1                         4176
#define WPUC2                         4177
#define WPUC3                         4178
#define WPUC4                         4179
#define WPUC5                         4180
#define WPUC6                         4181
#define WPUC7                         4182
#define ODCONC                        4183
#define ODCC0                         4184
#define ODCC1                         4185
#define ODCC2                         4186
#define ODCC3                         4187
#define ODCC4                         4188
#define ODCC5                         4189
#define ODCC6                         4190
#define ODCC7                         4191
#define SLRCONC                       4192
#define SLRC0                         4193
#define SLRC1                         4194
#define SLRC2                         4195
#define SLRC3                         4196
#define SLRC4                         4197
#define SLRC5                         4198
#define SLRC6                         4199
#define SLRC7                         4200
#define INLVLC                        4201
#define INLVLC0                       4202
#define INLVLC1                       4203
#define INLVLC2                       4204
#define INLVLC3                       4205
#define INLVLC4                       4206
#define INLVLC5                       4207
#define INLVLC6                       4208
#define INLVLC7                       4209
#define IOCCP                         4210
#define IOCCP0                        4211
#define IOCCP1                        4212
#define IOCCP2                        4213
#define IOCCP3                        4214
#define IOCCP4                        4215
#define IOCCP5                        4216
#define IOCCP6                        4217
#define IOCCP7                        4218
#define IOCCN                         4219
#define IOCCN0                        4220
#define IOCCN1                        4221
#define IOCCN2                        4222
#define IOCCN3                        4223
#define IOCCN4                        4224
#define IOCCN5                        4225
#define IOCCN6                        4226
#define IOCCN7                        4227
#define IOCCF                         4228
#define IOCCF0                        4229
#define IOCCF1                        4230
#define IOCCF2                        4231
#define IOCCF3                        4232
#define IOCCF4                        4233
#define IOCCF5                        4234
#define IOCCF6                        4235
#define IOCCF7                        4236
#define CCDNC                         4237
#define CCDNC0                        4238
#define CCDNC1                        4239
#define CCDNC2                        4240
#define CCDNC3                        4241
#define CCDNC4                        4242
#define CCDNC5                        4243
#define CCDNC6                        4244
#define CCDNC7                        4245
#define CCDPC                         4246
#define CCDPC0                        4247
#define CCDPC1                        4248
#define CCDPC2                        4249
#define CCDPC3                        4250
#define CCDPC4                        4251
#define CCDPC5                        4252
#define CCDPC6                        4253
#define CCDPC7                        4254
#define ANSELD                        4255
#define ANSD0                         4256
#define ANSD1                         4257
#define ANSD2                         4258
#define ANSD3                         4259
#define ANSD4                         4260
#define ANSD5                         4261
#define ANSD6                         4262
#define ANSD7                         4263
#define WPUD                          4264
#define WPUD0                         4265
#define WPUD1                         4266
#define WPUD2                         4267
#define WPUD3                         4268
#define WPUD4                         4269
#define WPUD5                         4270
#define WPUD6                         4271
#define WPUD7                         4272
#define ODCOND                        4273
#define ODCD0                         4274
#define ODCD1                         4275
#define ODCD2                         4276
#define ODCD3                         4277
#define ODCD4                         4278
#define ODCD5                         4279
#define ODCD6                         4280
#define ODCD7                         4281
#define SLRCOND                       4282
#define SLRD0                         4283
#define SLRD1                         4284
#define SLRD2                         4285
#define SLRD3                         4286
#define SLRD4                         4287
#define SLRD5                         4288
#define SLRD6                         4289
#define SLRD7                         4290
#define INLVLD                        4291
#define INLVLD0                       4292
#define INLVLD1                       4293
#define INLVLD2                       4294
#define INLVLD3                       4295
#define INLVLD4                       4296
#define INLVLD5                       4297
#define INLVLD6                       4298
#define INLVLD7                       4299
#define CCDND                         4300
#define CCDND0                        4301
#define CCDND1                        4302
#define CCDND2                        4303
#define CCDND3                        4304
#define CCDND4                        4305
#define CCDND5                        4306
#define CCDND6                        4307
#define CCDND7                        4308
#define CCDPD                         4309
#define CCDPD0                        4310
#define CCDPD1                        4311
#define CCDPD2                        4312
#define CCDPD3                        4313
#define CCDPD4                        4314
#define CCDPD5                        4315
#define CCDPD6                        4316
#define CCDPD7                        4317
#define ANSELE                        4318
#define ANSE0                         4319
#define ANSE1                         4320
#define ANSE2                         4321
#define WPUE                          4322
#define WPUE0                         4323
#define WPUE1                         4324
#define WPUE2                         4325
#define WPUE3                         4326
#define ODCONE                        4327
#define ODCE0                         4328
#define ODCE1                         4329
#define ODCE2                         4330
#define SLRCONE                       4331
#define SLRE0                         4332
#define SLRE1                         4333
#define SLRE2                         4334
#define INLVLE                        4335
#define INLVLE0                       4336
#define INLVLE1                       4337
#define INLVLE2                       4338
#define INLVLE3                       4339
#define IOCEP                         4340
#define IOCEP3                        4341
#define IOCEN                         4342
#define IOCEN3                        4343
#define IOCEF                         4344
#define IOCEF3                        4345
#define CCDNE                         4346
#define CCDNE0                        4347
#define CCDNE1                        4348
#define CCDNE2                        4349
#define CCDPE                         4350
#define CCDPE0                        4351
#define CCDPE1                        4352
#define CCDPE2                        4353
#define STATUS_SHAD                   4354
#define C_SHAD                        4355
#define DC_SHAD                       4356
#define Z_SHAD                        4357
#define WREG_SHAD                     4358
#define BSR_SHAD                      4359
#define PCLATH_SHAD                   4360
#define FSR0L_SHAD                    4361
#define FSR0H_SHAD                    4362
#define FSR1L_SHAD                    4363
#define FSR1H_SHAD                    4364
#define STKPTR                        4365
#define TOSL                          4366
#define TOSH                          4367

#endif // _PIC16F18876_H_
